Revit 2015 API
PositionOnCurve Enumeration
 Specifies position on analytical curve to calculate direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public enum PositionOnCurve
Visual Basic
Public Enumeration PositionOnCurve
Visual C++
public enum class PositionOnCurve
Members
Member name | Description
StartPointPosition |  Direction in start point of analytical curve.
EndPointPosition |  Direction in end point of analytical curve.
MainPosition |  Common direction from start to end points.
See Also
Autodesk.Revit.DB.Structure Namespace